'use client'
import { FC } from 'react'
import React, { useEffect, useRef, useState } from 'react'
import { motion } from 'framer-motion'
import Ilness from './Ilness'
import Particle from '../Particles'

const diseases = [
  {
    id: 1,
    title: 'مراقبت‌های پیش از بارداری',
    description:
      'مراقبت های دوران بارداری محدود به طول زمان بارداری نیست بلکه نیاز است خانم هایی که قصد باردار شدن دارند از سه ماه پیش از اقدام تحت نظر پزشک باشد تا آزمایش های لازم ، معاینات و در صورت نیاز پاپ اسمیر و ماموگرافی برای ایشان انجام شود و از لحاظ سایر بیماری های داخلی نیز مورد بررسی قرار بگیرند  تا در صورت وجود هر مشکل پیش از باردار شدن جهت رفع یا کنترل آن اقدام شود.',
  },
  {
    id: 2,
    title: 'مراقبت‌های طول بارداری',
    description:
      'در طول مدت بارداری نیاز است طبق برنامه کشوری خانم های باردار در فواصل معین مورد معاینه قرار بگیرند و از نظر مشکلات،  آزمایش ها و سونوگرافی ارزیابی شوند   و به پرسش های احتمالی ایشان پاسخ داده شود. همینطور در این مدت نیاز است از نظر تغییرات وزن ، فشار خون و تخمین اندازه جنین تحت نظر باشند تا در صورت وجود اختلال در هر یک از این موارد اقدامات لازم انجام شود تا کمترین آسیب مادری و جنینی اتفاق بیفتد.',
  },
  {
    id: 3,
    title: 'مراقبت‌های پس از زایمان',
    description:
      'تا ۴۲ روز یعنی ۶ هفته پس از زایمان نیز لازم است خانم های باردار با متخصص زنان در ارتباط باشد ، چون مشکلات داخلی یا جراحی ایجاد شده برای ایشان در این مدت ممکن است ریشه دوران بارداری داشته باشد و نیازمند مداخلات خاص باشد . برای مثال لخته شدن خون در وریدهای ساق اندام تحتانی مشکلی است که احتمال بروز آن در ۶ هفته پس از زایمان افزایش می یابد.',
  },
  {
    id: 4,
    title: 'سرکلاژ',
    description:
      'یک عمل جراحی است که به معنای دوختن گرداگرد گردن رحم می باشد . این جراحی در تعداد معدودی از خانم های باردار که دارای مشکلاتی در ساختمان یا طول گردن رحم می باشد جهت پیشگیری از زایمان زودرس در نیمه اول بارداری انجام میشود.',
  },
  {
    id: 5,
    title: 'عفونت‌ها',
    description:
      'عفونت ها یکی از شایع‌ترین دلایل مراجعه خانم ها به مطب متخصصان زنان می باشد. این عفونت ها در هر ناحیه ای می تواند ایجاد شود واژن ، سرویکس  یا گردن رحم، رحم و لگن توانند نواحی درگیر عفونت‌ها باشد  که هرکدام درمانهای مخصوص به خود را دارد.  تشخیص به وسیله شرح حال ، معاینه ، آزمایش و سونوگرافی است.',
  },
  {
    id: 6,
    title: 'خونریزیهای غیرطبیعی رحم',
    description:
      'طول مدت سیکل قاعدگی ۲۳ تا ۳۸ روز و طول مدت خونریزی ۷ تا ۸ روز طبیعی است. هر نوع تغییر سیکل های قاعدگی از این روند یا افزایش بیش از حد معمول خونریزی نیازمند بررسی و گاهی درمان است. از آنجایی که خونریزی های غیرطبیعی رحم می تواند ریشه در مشکلات داخلی مثل برخی مشکلات هورمونی یا سرطان های زنان داشته باشند اغلب لازم است پیش از هر اقدام شرح حال ، معاینه ، آزمایش هورمونی و سونوگرافی انجام شود .',
  },
  {
    id: 7,
    title: 'بیوپسی اندومتر یا نمونه‌برداری آندومتر',
    description:
      'یک روش بسیار عالی برای تشخیص سرطان های جسم رحم می باشد . این کار بسته به شرایط بیمار به دو صورت انجام می شود : ۱ -روش سرپایی یا پایپل در این روش به وسیله لوازم مخصوص ، در مطب و بدون نیاز به بیهوشی از بافت رحم نمونه برداری میشود ۲- روش کودتاژ تشخیصی در اتاق عمل : این روش در بیمارستان و تحت بیهوشی امکانپذیر است.  سپس نمونه بافتی به دست آمده جهت بررسی بافت شناسی ( پاتولوژی ) به آزمایشگاه ارسال می شود و درمان بر اساس نتایج بررسی بافت شناسی انجام می گیرد.',
  },
  {
    id: 8,
    title: 'پاپ اسمیر',
    description:
      'بهترین روش برای تشخیص زودرس سرطان های گردن رحم می باشد. در این روش به صورت سرپایی مقداری از بافت گردن رحم جهت بررسی پاتولوژی تراشیده می شود. اگر همراه با بررسی پاتولوژی ، این نمونه از نظر ویروس زگیل یا پاپیلوما نیز مورد بررسی قرار بگیرد دقت تشخیصی بسیار بالاتر خواهد بود. امروزه روش ارجح بررسی همزمان بافت‌شناسی و ویروسی است.',
  },
]
interface DiseasesProps {}

const Diseases: FC<DiseasesProps> = ({}) => {
  const [width, setWidth] = useState(0)
  const carousel = useRef<HTMLElement>(null)
  useEffect(() => {
    setWidth(carousel!.current!.scrollWidth - carousel!.current!.offsetWidth)
  }, [])
  return (
    <motion.section
      ref={carousel}
      className={`overflow-x-hidden my-16 ${`services`} ${`carousel`}`}
    >
      {/* <Particle  /> */}
      <div className={`${`center`}`}>
        <article className={`title `}>
          <h2 className="mb-28">خدمات </h2>
        </article>
        <motion.article
          drag="x"
          dragConstraints={{ left: 0, right: width }}
          whileTap={{ cursor: 'grabbing' }}
          className={`innerCrousel flex cursor-grab -mx-4 `}
        >
          {diseases.map((ilness) => (
            <Ilness
              key={ilness.id}
              className={`service min-h-[40rem] w-[45rem] `}
              title={ilness.title}
              text={ilness.description}
            />
          ))}
        </motion.article>
      </div>
    </motion.section>
  )
}

export default Diseases
